<a href="https://colab.research.google.com/github/nilotpalc/Python-Training/blob/master/GroupBy_Merge_Concat_Join_Operations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [0]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [0]:
df = pd.DataFrame(data)

In [4]:
df.groupby('Company').sum() # running the groupby to return sum of all column labels

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [5]:
df.groupby('Company').sum().loc[['FB','GOOG']] # using .loc method to extract datasets at a row-level

         Sales
Company
FB         593
GOOG       320

In [6]:
df['Sales'].sum() # run methods on columns

1377

In [7]:
df.groupby('Company').describe() # tis creates a multi-level column header dataframe

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [8]:
df.groupby('Company').describe().xs(('Sales'),axis =1) # running xs on describe dataframe to extract information

         count   mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [9]:
df.groupby('Company').describe().xs(('Sales'),axis =1)[['count','mean']]

         count   mean
Company
FB         2.0  296.5
GOOG       2.0  160.0
MSFT       2.0  232.0

In [0]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [11]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [12]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [13]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [14]:
left.join(right)

ValueError: ignored

In [15]:
left.join(right,lsuffix='x',rsuffix='y') # using suffix notation helps the output provide different names to overlapping columns

  key1x key2x   A   B key1y key2y   C   D
0    K0    K0  A0  B0    K0    K0  C0  D0
1    K0    K1  A1  B1    K1    K0  C1  D1
2    K1    K0  A2  B2    K1    K0  C2  D2
3    K2    K1  A3  B3    K2    K0  C3  D3

In [16]:
left.set_index('key1',inplace=True)
right.set_index('key1',inplace=True)
left.join(right,lsuffix='x')

     key2x   A   B key2   C   D
key1
K0      K0  A0  B0   K0  C0  D0
K0      K1  A1  B1   K0  C0  D0
K1      K0  A2  B2   K0  C1  D1
K1      K0  A2  B2   K0  C2  D2
K2      K1  A3  B3   K0  C3  D3

In [17]:
left

     key2   A   B
key1
K0     K0  A0  B0
K0     K1  A1  B1
K1     K0  A2  B2
K2     K1  A3  B3

In [18]:
right

     key2   C   D
key1
K0     K0  C0  D0
K1     K0  C1  D1
K1     K0  C2  D2
K2     K0  C3  D3

In [19]:
right['key2'].unique() # running unique for Columns

array(['K0'], dtype=object)

In [21]:
right.loc['K0'].unique() # running unique for Rows

array(['K0', 'C0', 'D0'], dtype=object)

In [22]:
left.index

Index(['K0', 'K0', 'K1', 'K2'], dtype='object', name='key1')

In [23]:
left.index.unique()

Index(['K0', 'K1', 'K2'], dtype='object', name='key1')

In [24]:
left.index.unique().tolist() # list of index elements

['K0', 'K1', 'K2']

In [25]:
left.columns.values.tolist()  # list of column elements

['key2', 'A', 'B']